app/controllers/videos_controller.rb

INSERT INTO "videos" ("created_at", "file_url", "file_url_tmp", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 05 Jun 2013 22:57:19 UTC +00:00], ["file_url", nil], ["file_url_tmp", "20130605-1557-76344-6362/mini_copy_2.mp4"], ["updated_at", Wed, 05 Jun 2013 22:57:19 UTC +00:00]]
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save

UPDATE "videos" SET "file_attachment" = $1, "file_attachment_tmp" = $2, "updated_at" = $3 WHERE "videos"."id" = 1  [["file_attachment", "mini_copy.mp4"], ["file_attachment_tmp", "20130606-0922-78598-3122/3699-91e79cb6.mp4"], ["updated_at", Thu, 06 Jun 2013 16:22:17 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @video.update(video_params)